/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Postupak se ne može dovršiti";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Desila se nepoznata greška (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Postupak se ne može dovršiti";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Pokušajte kasnije.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Snimanje nije moguće";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Pokušajte ponovno snimati.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Snimanje nije moguće";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Zaustavite sve druge postupke koji koriste %@ i pokušajte ponovno."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Snimanje nije moguće";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Pokušajte ponovno snimati.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Snimanje je zaustavljeno";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Pokušajte ponovno snimati.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Postupak je zaustavljen";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Nema dovoljno slobodnog prostora za nastavak zapisivanja datoteke. Napravite mjesta brisanjem postojećih videozapisa ili fotografija.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Snimanje je zaustavljeno";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Pokušajte ponovno snimati.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Snimanje je zaustavljeno";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Pokušajte ponovno snimati.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Snimanje je zaustavljeno";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Dosegnuta je maksimalna duljina za ovu snimku."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Snimanje je zaustavljeno";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Dosegnuta je maksimalna veličina za ovu snimku."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Snimanje je zaustavljeno";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Zaustavite sve druge postupke koji koriste uređaj za snimanje i pokušajte ponovno.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Snimanje je zaustavljeno";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Dosegnuta je maksimalna duljina za ovu snimku."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Snimanje nije moguće";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Pokušajte ponovno snimati.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "%@ se ne može koristiti"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Zaustavite sve druge postupke koji koriste %@ i pokušajte ponovno."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "%@ se ne može koristiti"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Zaustavite sve druge postupke koji koriste %@ i pokušajte ponovno."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Snimanje je zaustavljeno";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Zaustavite sve druge postupke koji koriste uređaj za snimanje i pokušajte ponovno.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Postupak se ne može dovršiti";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Pokušajte kasnije.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Eksportiranje se ne može dovršiti";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Pokušajte ponovno eksportirati.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Ne može se dekodirati";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Podaci medija ne mogu se dekodirati. Medij je možda oštećen.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Ovaj format medija nije podržan.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Ne može se spremiti";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Pokušajte ponovno spremiti.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Ovaj medij se ne može koristiti.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Ovaj medij se ne može koristiti.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Ovaj medij se ne može koristiti.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Ovaj medij se ne može koristiti.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Ovaj format medija nije podržan.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Ovaj medij je možda oštećen.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Fotografija se ne može snimiti";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Pokušajte ponovno snimiti fotografiju.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Postupak je zaustavljen";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Postupak nije podržan za zaštićeni sadržaj."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Ovaj sadržaj nije autoriziran."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Ova aplikacija nije ovlaštena za reproduciranje ove datoteke."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Ovaj medij se ne može koristiti.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Ne može se dekodirati";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Nije pronađen potreban dekoder za ovaj medij.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Ne može se kodirati";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Nije pronađen potreban enkoder za ovaj medij.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Ne može se dekodirati";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Dekoder koji je potreban za ovaj medij je zauzet.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Zaustavite sve druge postupke koji dekodiraju medij i pokušajte ponovno.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Ne može se kodirati";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Enkoder koji je potreban za ovaj medij je zauzet.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Zaustavite sve druge postupke koji kodiraju medij i pokušajte ponovno.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "%@ se ne može koristiti"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Aplikacija koja radi u pozadini možda neće koristiti %@."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Postupak je zaustavljen";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Postupak nije podržan za ovaj medij.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Postupak je zaustavljen";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Video se ne može sastaviti prema navedenim uputama.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Ne može se otvoriti";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Ovaj medij se ne može koristiti.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Postupak je zaustavljen";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Ne može se koristiti datoteka pričuvne memorije na odredišnom URL-u za preuzimanje.";
